app/controllers/api/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def index
    @reviews = Trainer.find(params[:trainer_id]).reviews

INSERT INTO "reviews" ("user_id", "trainer_id", "rating", "body") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["trainer_id", 1], ["rating", 3], ["body", "Created on the web console"]]
---
  def create
    @review = Review.new(review_params)

    if @review.save