app/controllers/api/trainers_controller.rb

  def index
    if params[:search]
      @trainers = Trainers.search(params[:search])
---
SELECT "trainers".* FROM "trainers" WHERE (obedience)

  def show
    @trainer = Trainer.find_by_id(params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]